In [1]:
import pandas as pd
import numpy as np
from sklearn import naive_bayes

In [2]:
data = pd.read_csv('titanic.csv') 
(data.head())
#print(data['Ticket'])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [3]:
type(data)

pandas.core.frame.DataFrame

In [4]:
clean_data = data.replace(['female', 'male', 'S', 'C', 'Q'], [1, 0, 0, 1, 2])
clean_data = clean_data.drop(['PassengerId', 'Name', 'Ticket', 'Cabin','Fare', 'Embarked'], axis = 1)
#clean_data = clean_data[pd.notnull(clean_data['Age'])]
#clean_data = clean_data[pd.notnull(clean_data['Embarked'])]
clean_data.head()

   Survived  Pclass  Sex  Age  SibSp  Parch
0         0       3    0   22      1      0
1         1       1    1   38      1      0
2         1       3    1   26      0      0
3         1       1    1   35      1      0
4         0       3    0   35      0      0

In [9]:
mean_age = np.mean(clean_data['Age'])
clean_data = clean_data.fillna(mean_age)

In [10]:
#Sex and Pclass
clf = naive_bayes.GaussianNB()
X = clean_data.drop(['Survived'], axis = 1)
Y = clean_data['Survived']
clf.fit(X,Y)
#clf.predict()
#print(clf.predict([[1,0,3,3,2,0],[3,1,30,1,0,0]]))

GaussianNB()

In [11]:
test_data = pd.read_csv('titanic_test.csv') 
clean_test_data = test_data.replace(['female', 'male', 'S', 'C', 'Q'], [1, 0, 0, 1, 2])
clean_test_data = clean_test_data.drop(['PassengerId', 'Name', 'Ticket', 'Cabin','Fare', 'Embarked'], axis = 1)
#clean_test_data = clean_test_data[pd.notnull(clean_test_data['Age'])]
#clean_test_data = clean_test_data[pd.notnull(clean_test_data['Embarked'])]
clean_test_data = clean_test_data.fillna(mean_age)
(clean_test_data.head())

   Pclass  Sex   Age  SibSp  Parch
0       3    0  34.5      0      0
1       3    1  47.0      1      0
2       2    0  62.0      0      0
3       3    0  27.0      0      0
4       3    1  22.0      1      1

In [12]:
outcome = clf.predict(clean_test_data)
print(outcome)

[0 1 0 0 1 0 1 0 1 0 0 0 1 0 1 1 0 0 1 1 1 0 1 1 1 0 1 0 0 0 0 0 1 1 0 0 1
 1 0 0 0 1 0 1 1 0 0 0 1 1 0 0 1 0 0 0 0 0 0 1 0 0 0 1 0 1 1 0 0 1 1 0 1 1
 1 0 0 1 0 1 0 1 1 0 0 0 1 1 1 0 1 0 1 0 1 0 1 0 1 0 1 0 0 0 1 0 0 0 0 0 0
 1 1 1 1 0 0 1 0 1 1 0 1 0 0 1 0 0 0 0 0 1 1 0 0 0 0 0 1 0 0 1 1 0 0 0 1 0
 1 0 1 0 0 1 0 0 1 1 0 1 1 0 1 0 0 1 1 0 1 1 0 0 0 0 0 1 1 1 1 1 0 1 1 0 1
 0 1 0 0 0 0 1 0 0 0 0 1 1 0 1 1 0 0 1 0 1 1 0 1 0 0 0 0 1 0 0 1 1 1 0 1 0
 1 0 1 1 0 1 0 0 0 1 0 0 0 0 1 0 1 1 1 1 1 0 0 0 1 0 1 1 1 0 0 0 0 0 0 0 1
 0 0 0 1 1 0 0 1 0 1 0 0 0 1 1 0 1 0 0 0 0 1 0 1 1 1 0 0 0 0 0 1 1 0 1 0 0
 1 0 1 0 0 0 0 0 1 1 1 0 1 1 0 0 0 1 1 1 1 0 0 0 0 0 0 0 1 0 1 0 0 0 1 0 0
 1 0 1 0 0 0 0 0 0 0 1 0 1 0 1 0 1 1 0 0 0 1 1 1 0 0 1 0 1 1 0 1 0 0 1 1 0
 0 1 1 0 1 1 1 0 1 0 0 0 1 1 0 1 0 0 0 0 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 0 0
 1 1 1 1 1 1 0 1 0 0 0]

In [13]:
outcome_data = test_data.drop(['Name', 'Ticket', 'Cabin','Fare', 'Embarked', 'Age', 'Pclass','Sex','SibSp', 'Parch'], axis = 1)
#outcome_data = outcome_data.add([''], axis = 1)

In [14]:
outcome_data['Survived'] = outcome

In [15]:
outcome_data.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [16]:
outcome_data.to_csv('outcome_data.csv')